tap "goodwithtech/r"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "tabbyml/tabby"
brew "ca-certificates"
brew "libyaml"
brew "sqlite"
brew "python@3.11"
brew "ansible@7", link: true
brew "imath"
brew "libpng"
brew "libtiff"
brew "openexr"
brew "jpeg-xl"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "libssh2"
brew "bat"
brew "icu4c"
brew "boost"
brew "gcc"
brew "btop"
brew "buildkit"
brew "freetype"
brew "glib"
brew "circleci"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "csvkit"
brew "libnghttp2"
brew "openldap"
brew "curl"
brew "d2"
brew "direnv"
brew "dive"
brew "docker-completion"
brew "dos2unix"
brew "duf"
brew "exiftool"
brew "fzf"
brew "gawk"
brew "openjpeg"
brew "ghostscript"
brew "git"
brew "git-extras"
brew "git-sizer"
brew "gnu-sed"
brew "nettle"
brew "gnutls"
brew "libassuan"
brew "libksba"
brew "gnupg"
brew "go"
brew "libtool"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "libde265"
brew "libheif"
brew "libomp", link: true
brew "imagemagick"
brew "jid"
brew "jmeter"
brew "jq"
brew "node"
brew "jsonlint"
brew "k9s"
brew "krb5"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "lesspipe"
brew "libdvdcss"
brew "libffi"
brew "libxml2"
brew "llvm"
brew "mkcert"
brew "zlib"
brew "mysql-client", link: true
brew "nmap"
brew "nss"
brew "nvm"
brew "odt2txt"
brew "ollama"
brew "openssl@1.1"
brew "p7zip"
brew "pandoc"
brew "parallel"
brew "podman"
brew "podman-compose"
brew "postgresql@14", restart_service: true
brew "qemu"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby-build"
brew "shellcheck"
brew "socat"
brew "source-highlight"
brew "spark"
brew "ssh-copy-id"
brew "starship"
brew "tree"
brew "trivy"
brew "v8"
brew "watch"
brew "wget"
brew "xml-coreutils"
brew "yamllint"
brew "yarn"
brew "yarn-completion"
brew "zsh-completions"
brew "goodwithtech/r/dockle"
brew "tabbyml/tabby/tabby"
cask "1password-cli"
cask "alfred"
cask "chromium"
cask "font-hack-nerd-font"
cask "geekbench"
cask "geekbench-ml"
cask "google-cloud-sdk"
cask "kitty"
cask "metaz"
cask "podman-desktop"
cask "powershell"
cask "warp"
vscode "asciidoctor.asciidoctor-vscode"
vscode "castwide.ruby-debug"
vscode "circleci.circleci"
vscode "coolbear.systemd-unit-file"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "fnando.linter"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "glebv.vscode-open-in-stash"
vscode "golang.go"
vscode "iliazeus.vscode-ansi"
vscode "jebbs.plantuml"
vscode "koichisasada.vscode-rdbg"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.java"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-xml"
vscode "shopify.ruby-lsp"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "waderyan.gitblame"
vscode "william-voyek.vscode-nginx"
vscode "yzhang.markdown-all-in-one"
