tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "instantclienttap/instantclient"
brew "ca-certificates"
brew "libyaml"
brew "openssl@1.1"
brew "openssl@3"
brew "ansible"
brew "libtiff"
brew "automake"
brew "bash"
brew "bash-completion"
brew "boost"
brew "buildkit"
brew "circleci"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "libnghttp2"
brew "openldap"
brew "curl"
brew "direnv"
brew "dive"
brew "docker-completion"
brew "dos2unix"
brew "exiftool"
brew "fzf"
brew "gcc"
brew "gh"
brew "openjpeg"
brew "git"
brew "git-crypt"
brew "git-extras"
brew "git-sizer"
brew "glib"
brew "gnu-sed"
brew "libtool"
brew "gnutls"
brew "gnupg"
brew "go"
brew "htop"
brew "hub"
brew "hyperfine"
brew "libffi"
brew "libheif"
brew "libomp", link: true
brew "imagemagick"
brew "jq"
brew "python@3.10"
brew "k9s"
brew "kubernetes-cli", link: false
brew "kubectx"
brew "lazygit"
brew "lesspipe"
brew "libdvdcss"
brew "libxml2"
brew "llvm"
brew "mkcert"
brew "zlib"
brew "mysql-client", link: true
brew "nmap"
brew "node"
brew "nvm"
brew "odt2txt"
brew "p7zip"
brew "parallel"
brew "podman"
brew "postgresql@14"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby-build"
brew "shellcheck"
brew "socat"
brew "source-highlight"
brew "spark"
brew "ssh-copy-id", link: true
brew "tree"
brew "v8"
brew "watch"
brew "wget"
brew "xml-coreutils"
brew "yamllint"
brew "yarn"
brew "yarn-completion"
cask "1password-cli"
cask "google-cloud-sdk"
cask "makemkv"
cask "obs"
cask "postman"
cask "powershell"
cask "vlc"
