tap "ankitpokhrel/jira-cli"
tap "jwt-rs/jwt-ui"
tap "oven-sh/bun"
tap "passbolt/tap"
tap "tabbyml/tabby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Mozilla CA certificate store
brew "ca-certificates"
# YAML Parser
brew "libyaml"
# Command-line interface for SQLite
brew "sqlite"
# CLI tool for scaffolding Ansible Content
brew "ansible-creator"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Automate deployment, configuration, and upgrading
brew "ansible@8", link: true
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# Library for manipulating PNG images
brew "libpng"
# TIFF library and utilities
brew "libtiff"
# High dynamic-range image file format
brew "openexr"
# New file format for still image compression
brew "jpeg-xl"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Concurrent, cache-efficient, and Dockerfile-agnostic builder toolkit
brew "buildkit"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Encrypt and decrypt files and streams
brew "ccrypt"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# HTTP/2 C Library
brew "libnghttp2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Isolated development environments using Docker
brew "docker-compose"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Compute various size metrics for a Git repository
brew "git-sizer"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Low-level cryptographic library
brew "nettle"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Assuan IPC Library
brew "libassuan"
# X.509 and CMS library
brew "libksba"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# Open h.265 video codec implementation
brew "libde265"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Json incremental digger
brew "jid"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Network authentication protocol
brew "krb5"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Input filter for the pager less
brew "lesspipe"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Portable Foreign Function Interface library
brew "libffi"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# GNOME XML library
brew "libxml2"
# Next-gen compiler infrastructure
brew "llvm"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Minimal CLI coding agent
brew "mistral-vibe"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node@24", link: true
# Libraries for security-enabled client and server applications
brew "nss"
# Convert OpenDocument files to plain text
brew "odt2txt"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Paste PNG into files
brew "pngpaste"
# Fast, disk space efficient package manager
brew "pnpm"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Generic machine emulator and virtualizer
brew "qemu"
# Bash completion for Rails
brew "rails-completion"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install various Ruby versions and implementations
brew "ruby-build"
# BDD unit testing framework for dash, bash, ksh, zsh and all POSIX shells
brew "shellspec"
# Autoformat shell script source code
brew "shfmt"
# SOcket CAT: netcat on steroids
brew "socat"
# Source-code syntax highlighter
brew "source-highlight"
# Sparklines for the shell
brew "spark"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Collection of Linux utilities
brew "util-linux"
# Google's JavaScript engine
brew "v8"
# Command-line hypervisor using Apple's Virtualization Framework
brew "vfkit"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Powerful interactive system for text processing
brew "xml-coreutils"
# Linter for YAML files
brew "yamllint"
# Bash completion for Yarn
brew "yarn-completion"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# A Terminal UI for decoding/encoding JSON Web Tokens
brew "jwt-rs/jwt-ui/jwt-ui"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Tabby: AI Coding Assistant
brew "tabbyml/tabby/tabby"
# Command-line interface for 1Password
cask "1password-cli"
# Open source IDE for exploring and testing APIs
cask "bruno"
# OpenAI's coding agent that runs in your terminal
cask "codex"
cask "font-hack-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Application for generating k6 test scripts
cask "k6-studio"
# Discover, download, and run local LLMs
cask "lm-studio"
# Clipboard manager
cask "maccy"
# Mp4 meta-data editor
cask "metaz"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# API testing tool
cask "soapui"
# Visually compare folders and files
cask "visualdiffer"
# All-in-One Java Troubleshooting Tool
cask "visualvm"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "continue.continue"
vscode "docker.docker"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "fnando.linter"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "iliazeus.vscode-ansi"
vscode "koichisasada.vscode-rdbg"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ryanluker.vscode-coverage-gutters"
vscode "tamasfe.even-better-toml"
vscode "thadeu.vscode-run-rspec-file"
vscode "vitest.explorer"
vscode "vmware.vscode-boot-dev-pack"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
go "github.com/spf13/cobra-cli"
go "github.com/jesperronn/filemirror-fmr/cmd/fmr"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
